app/controllers/movies_controller.rb

INSERT INTO "movies" ("created_at", "genres", "title", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 23 May 2014 18:01:22 UTC +00:00], ["genres", "classical"], ["title", "lagan"], ["updated_at", Fri, 23 May 2014 18:01:22 UTC +00:00], ["year", Tue, 05 May 2015]]
---
def create
	Movie.create(:title=> params[:movie][:title],:genres=> params[:movie][:genres],:year=>params[:movie][:year])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
UPDATE "movies" SET "title" = 'dil', "updated_at" = '2014-05-23 18:02:07.504363' WHERE "movies"."id" = 1
---
def update
	movie = Movie.find_by_id(params[:id])
	if movie.nil?
	 render :json =>  {:message =>" Movie record does not exist" }
	else
		movie.attributes = params[:movie]
		movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
def destroy
	movie= Movie.find_by_id(params[:id])
	if movie.nil?
	 render :json =>  {:message =>" Movie record does not exist" }
	else
		movie.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("created_at", "is_like", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 23 May 2014 20:04:43 UTC +00:00], ["is_like", true], ["movie_id", 2], ["updated_at", Fri, 23 May 2014 20:04:43 UTC +00:00], ["user_id", 1]]
---
def movie_like
	user = User.find_by_id( params[:movie][:user_id])
	 # render :json =>  {:message =>" You have already liked this movie" }
	movie = Movie.find_by_id(params[:id])

	already_like = Like.where(:user_id=> user.id, :movie_id=> movie.id,:is_like=> true )
	if already_like.present?
	 render :json =>  {:message =>" You have already liked this movie" }
	else
	   user.likes.create(:movie_id=>movie.id,:is_like=>params[:movie][:is_like])