app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'nadirjahan@yahoo.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 23 May 2014 17:25:45 UTC +00:00], ["email", "nadirjahan@yahoo.com"], ["name", "nadir"], ["updated_at", Fri, 23 May 2014 17:25:45 UTC +00:00]]
---
def create
	user= User.find_by_email(params[:user][:email])
	if user.nil?
	User.create(:email=> params[:user][:email],:name=> params[:user][:name])

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "name" = 'shoaib', "updated_at" = '2014-05-23 17:41:44.954695' WHERE "users"."id" = 2
---
def update
	user= User.find_by_id(params[:id])
	if user.nil?
	 render :json =>  {:message =>" User record does not exist" }
	else
		user.attributes = params[:user]
		user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
def destroy
	user= User.find_by_id(params[:id])
	if user.nil?
	 render :json =>  {:message =>" User record does not exist" }
	else
		user.destroy